Tekla.Structures.Drawing.InsidePartHorizontalOrWithLeaderLinePlacingType
The InsidePartHorizontalOrWithLeaderLinePlacingType class defines a placing
type that places the object using the base line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line.
The base line used is in the middle of the part, aligned with the part.
In addition the object will be rotated to be horizontal in the drawing.

Tekla.Structures.Drawing.InsidePartHorizontalOrWithLeaderLinePlacingType.#ctor
Creates a new inside part horizontal or with leader line placing type instance.